#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
aws_kms_key.ecr_kms_key: Refreshing state... [id=ab9a7d92-2262-43f7-b0f1-3672f6f76e7e]
data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_kms_alias.ecr_key_alias: Refreshing state... [id=alias/app-10-encrypt-ecr]
aws_kms_key_policy.ecr_key_policy: Refreshing state... [id=ab9a7d92-2262-43f7-b0f1-3672f6f76e7e]
aws_ecr_repository.image_repo: Refreshing state... [id=app-10]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.image_repo must be replaced
-/+ resource "aws_ecr_repository" "image_repo" {
      ~ arn                  = "arn:aws:ecr:us-east-2:743794601996:repository/app-10" -> (known after apply)
      ~ id                   = "app-10" -> (known after apply)
      ~ name                 = "app-10" -> "app-8" # forces replacement
      ~ registry_id          = "743794601996" -> (known after apply)
      ~ repository_url       = "743794601996.dkr.ecr.us-east-2.amazonaws.com/app-10" -> (known after apply)
      - tags                 = {} -> null
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_kms_alias.ecr_key_alias must be replaced
-/+ resource "aws_kms_alias" "ecr_key_alias" {
      ~ arn            = "arn:aws:kms:us-east-2:743794601996:alias/app-10-encrypt-ecr" -> (known after apply)
      ~ id             = "alias/app-10-encrypt-ecr" -> (known after apply)
      ~ name           = "alias/app-10-encrypt-ecr" -> "alias/app-8-encrypt-ecr" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-east-2:743794601996:key/ab9a7d92-2262-43f7-b0f1-3672f6f76e7e" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_kms_key.ecr_kms_key will be updated in-place
  ~ resource "aws_kms_key" "ecr_kms_key" {
        id                                 = "ab9a7d92-2262-43f7-b0f1-3672f6f76e7e"
      ~ tags                               = {
          ~ "Name" = "app-10-encrypt-ecr" -> "app-8-encrypt-ecr"
        }
      ~ tags_all                           = {
          ~ "Name"   = "app-10-encrypt-ecr" -> "app-8-encrypt-ecr"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ repository_name = "app-10" -> "app-8"
  ~ repository_url  = "743794601996.dkr.ecr.us-east-2.amazonaws.com/app-10" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*